[
  {
    "path": "posts/2021-06-10-dataviz-makeover-2/",
    "title": "DataViz Makeover 2 - Merchandise trade",
    "description": "DataViz Makeover 2 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "Jovinka Hartanto",
        "url": "https://www.linkedin.com/in/jovinkahartanto/"
      }
    ],
    "date": "2021-06-10",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Critique of Visualisation2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Alternative Design\r\nClarity:\r\nAesthetics:\r\n4. Step-by-Step Guide4.1 Data Preparation\r\n4.2 Top 10 Trading Partners\r\n4.3 Import Export Trend\r\n4.4 Adding line graph as a tooltip for scatter plot\r\n4.5 Animations\r\n4.6 Dashboard\r\n\r\n5.0 Major Obeservations\r\n\r\n1. Introduction\r\nNowadays, data visualisation such as graphs and maps can be found anywhere. Data visualisation can help us to understand better what the information means and it will also make it easier to understand the trends, patterns, and outliers within large datasets. However, a poor data visualisation can be misleading or make it even harder to understand the information.\r\nThis post will makeover the chart below, so that it can be more fruitful for the audience. The data visualisation will be created by using data provided by Department of Statistics, Singapore (DOS). The data are available under the sub-section of Merchandise Trade by Region/Market.\r\n Source: Department of Statistics, Singapore\r\n2. Critique of Visualisation\r\nTo explore different perspective and design more truthful and enlightening data visualisation, we will first observe the original visualisation. The critiques will be divided into two section, clarity and aesthetics.\r\n2.1 Clarity\r\nThe label is not clear, it only shows country or trading partner name and number without explaining what is the number stands for, it can caused misinterpretation.\r\nThere is no gridlines in the chart to help the audience compare the import and export values, the non existence of gridline also make the data point is harder to read\r\nThere is not enough annotation or tooltip that can show the audience the import and export value\r\nThere is no clear explanation on how to determine the top net exporter and top net importer\r\n2.2 Aesthetics\r\nThe opacity of the chart can be reduced, since some of the plots overlap each other and it is hard to see if the centre point (white circle) of the bubbles falls in blue or green region\r\nA similar color is used to represent two different trading partners, Thailand and EU\r\nUsing an acronym for European Union (EU) make the naming of the trading partners inconsistent, since the rest of the trading partners was written in the long form\r\n3. Alternative Design\r\nThe alternative graphical design proposed can be seen below:\r\nFigure 2Clarity:\r\nAll the trading partners will be written in the long form\r\nAdded more information for each plot, which are total import, total export, total import and export, and lastly country’s monthly trend trading data for the selected year\r\nAdded gridlines to make the data point easier to read\r\nAesthetics:\r\nThe opacity and the size of the scatter plot has been reduced, therefore all the plots can be seen, even though some of they are overlapped\r\nGive a different colour for trading partners with value of exports exceeds imports and trading partners with sum of imports exceeds exports, therefore it will be easier to see which countries falls into which group rather than relying on the centre point of the plot like in the original visualisation\r\nAll the naming of trading partners are consistent, there is no acronym in the label of the plots\r\n4. Step-by-Step Guide\r\n4.1 Data Preparation\r\nCopy the table from the raw dataset and paste it into the first row of the new created worksheet by using excel workbook.\r\nRemove the data that is outside the study period. The study period for this study is between January 2011 to December 2020 for both import and export data. Clean import and export data are stored in the same file, but two different worksheets.\r\nImport clean dataset into tableau. There are few ways to import the dataset, two of them are:\r\nClick Microsoft Excel and select your file or\r\nFigure 3Drag the desired data file to tableau data source\r\nFigure 44.Drag new union to workspace\r\nFigure 5A union window will pop out, drag both import and export clean data to union window -> ok\r\nFigure 6To change the monthly data to columnar format, select the import and export data from 2011 Jan to 2020 Dec by clicking 2011 Jan data -> Press Shift and click 2020 Dec data. If you did it correctly, all the selected columns will turn blue.\r\nFigure 7Click the small arrow in 2020 Dec column -> Pivot\r\n 8. The result of the pivot is as shown below\r\nFigure 9Double click on the column name to rename it\r\nSince the date data type is marked as string, change the data type to Date by clicking abc in the column’s top left -> Date. Change Pivot Field Values data type to number instead of string\r\nFigure 10Since the variables consist of to components, trading partners and unit, we will split variables into two separate columns by clicking the small arrow in the column name -> Split\r\nFigure 11The Variables column will be split into 2 columns, Variables - split 1 and Variables - split 1\r\nFigure 12Rename it into Trading Partners and Unit** by double clicking the column names and type the desired column name.\r\nHide the original Variables column since we do not need it anymore\r\nFigure 13Do quality assurance (QA) to check any data discrepancies, especially for the split columns by dragging unit to the row pane in workspace canvas\r\nFigure 14Unit supposed to be either Million or Thousand, however it can be seen from the table below that there are other components that is not suppose to be in unit.\r\nFigure 15We can observe further by dragging Trading Partners into row shelves and Unit into filter -> untick Million and Thousand to see the which countries are these units belong to\r\nFigure 16Figure 17Figure 18Create another column or variable called “Trading_Partners_Cleaned” to store the modified partners’ name by using calculated field\r\nFigure 19Figure 20Create another calculated field called Unit_Cleaned, the formula is as follow\r\nFigure 21Separate the merchandise trade values into Export and Import variable by using calculated field and since merchandise trade values are in either Million or Thousand dollars, the value will be multiplied by 1,000 or 1,000,000 based on the unit. The formula for export and import value are as follow:\r\nFigure 22Figure 23It was observed that the trading partners are not only countries, it also consist of continents and total export and import. Since the focus in this study is to compare merchandise trade data between countries and union, we will create a calculated field that is only consist of countries and union.\r\n 21. Create another calculated field as Total Export & Import\r\nFigure 25Now the data preparation is done, merchandise trade data is ready to be used for the analysis.\r\n4.2 Top 10 Trading Partners\r\nIn a clean worksheet:\r\nDrag Export to columns shelves,Import to rows shelves, Country to detail in marks shelves to create the scatter plot\r\nDrag Country to Text, to show Country Name in the plot\r\nDrag Total Export & Import to tooltip, to give more information for each plot\r\nFigure 262.Drag Country to filters shelves \r\nChange the filter[Country] setting\r\nGeneral-> Untick null\r\nFigure 28Top -> By Field -> Change Country to Total Export & Import -> Apply -> Ok\r\nFigure 29Drag Date to filters shelves -> Double click on # Years\r\nFigure 30Click All -> Apply -> Ok\r\nFigure 31Show both Country and Year(Date) filter by clicking the small white arrow -> Show Filter\r\nFigure 32The selection default of this Filter[Country] is Multiple Values (list)\r\nFigure 33But, it will look better if we change it to Multiple Values (dropdown) . Click small black arrow in the selection beside the text Country -> Multiple Values (dropdown)\r\nFigure 34Repeat steps 5 and 6 for Filter[Year of Date], but instead of choosing Multiple Values (dropdown), choose Single Value (dropdown)\r\nRemove (All) from year selection. Click small black arrow beside the text Year(Date) -> Customize -> Show “All” Value\r\nFigure 35To change the chart title, double click on the title and change the title. However, in this case we want to insert YEAR(Date) selection variable to the title, the steps to add the selection variable are as follow:\r\nRemove , and type the text\r\nClick Insert -> YEAR(Date)\r\n 10. Change the plot from Automatic -> Circle\r\n 11. Adjust the size, by selecting the icon below\r\nFigure 38For visualization purposes, we will create a new boolean calculated field to separate the plot into two groups with two different colour. The first group is if sum of Import data higher than sum of Export data for the selected year. The second group is their sum of Export data higher than sum of Import data.\r\nThe calculated field formula is as follow:\r\n 13. Drag import>export variable to colour, and now we can see two different groups. Orange plots are those countries with sum of import higher than export for the selected year, year 2019 was selected for the example below\r\n 14. Adjust the color by clicking colour in marks shelves.\r\nFigure 4115.By default, all filters that are set in Tableau are computed independently. That is, each filter accesses all rows in the data source without regard to other filters.However in this case we need to filter the data by selected year and and pass the filtered data to select the top 10 total merchandise trade data. The steps are as follow:\r\nClick the small white arrow in YEAR(Date) filter\r\nFigure 42Click Add to Context\r\nFigure 43Adjust the opacity by clicking colour icon -> change the opacity percentage\r\n 17. Drag Total Export & Import to size, the bigger the size of the scatter plot, the higher the sum of total import & export for that country for the selected year. Adjust the circle size by clicking Size icon\r\n 18. Adjust the label font and alignment by clicking Label icon.\r\n 19. Create 45 degree line to show net importers and net exporters. The steps to create the 45 degree line, are as follow:\r\nDrag Import to columns shelf -> Click the small arrow -> Dual Axis\r\nClick Sum(Import) in the columns shelf and edit the components under marks shelf\r\nRemove Country (Text - SUM(Import)) and AGG(Total Export and Import) (Size and Tooltip - SUM(Import)) from Marks shelf\r\nChange the size to the smallest\r\nClick Color in SUM(Import) -> change the opacity to 0%\r\nRight click on the graph -> Trend Lines -> Show Trend Lines -> SUM(Import)\r\nChange the axis range to Fixed -> change Fixed start and Fixed end\r\nMake sure all axis have same range\r\nChange the format of the 45 degree line by double clicking the line -> Format\r\nChange the format of the trend line to dotted line\r\n4.3 Import Export Trend\r\nThis line chart is created to show the monthly import export trend for the selected year and selected country. The chart will be inserted in the Top 10 Trading Partners plot’s tooltip.\r\nCreate a new worksheet by clicking the icon below\r\n 2. Drag Country and Date variable to columns shelves, Import and Export to rows shelves\r\n 3. Click the small arrow in YEAR(Date) variable in columns pane -> Select month\r\nFigure 49Figure 50We will use dual lines graph for this chart.\r\nFigure 51Once you click dual lines graph, country variable will move to rows shelves, drag country back to columns shelves.\r\nTo make the colour of the axis title match with the color of the chart, right click on the axis -> Format\r\nFigure 52Click the small arrow beside Font -> Choose the colour\r\nFigure 53Repeat step 5 and 6 for export axis\r\nDouble click on the sheet name to rename it\r\n 9. Edit the alignment and format of the x-axis label by right clicking the x-axis -> Format\r\nChange the Alignment to up -> Change the label format MMM-YY\r\n4.4 Adding line graph as a tooltip for scatter plot\r\nClick the tooltip icon on scatter plot\r\n2.To insert the other chart to the tooltip, click Insert in Edit Tooltip window -> Sheets -> Select the chart that wanted to be added to the tooltip\r\n 3. Adjust maxwidth and mexheight according to the size of the inserted chart. In this case we will use 700 for maxwidth and 300 for maxheight\r\nFigure 56Drag Date into detail to make the chart in the tooltip become monthly trend for the selected year instead of yearly trend\r\nFigure 57The tooltip will look like the figure below when we hover the mouse over the plot.\r\nFigure 58Create a new calculation field for tooltip\r\nFigure 59Edit the tooltip by clicking tooltip in under All Marks shelves, edit the tooltip as per below\r\nFigure 604.5 Animations\r\nTurn on the animation by selecting Format -> Animation\r\n The settings for animation is as follows\r\nFigure 624.6 Dashboard\r\nCreate a new dashboard\r\nFigure 63Drag the Top 10 chart to the dashboard\r\nFigure 64Change the dashboard size to Automatic\r\nFigure 65Any objects can be added to the dashboard, in this case we want to edit text to the blank space by dragging Text to the blank space below the year selection\r\nFigure 66Once we drag the Text, Edit Text panel will instantly pop up, edit the text as per below\r\nFigure 67Add another text on top of the year selection, to add Select Year and Countries text\r\nThe final dashboard is ready, dashboard has been published to Tableau Public\r\n5.0 Major Obeservations\r\nIn 2011 India was one of the top 10 Singapore’s merchandise trading partner, however in 2012 the position was replaced by Thailand. India is never come back to the top 10 position until 2020.\r\n\r\nThe top 10 merchandise trading partners are remain the same for the past 8 years, from 2012 to 2020. The top 10 trading partners are:\r\nMainland China\r\nMalaysia\r\nIndonesia\r\nHongkong\r\nTaiwan\r\nJapan\r\nUnited States\r\nRepublic of Korea\r\nEuropean Union\r\nThailand\r\nSince 2011 up till 2020, Malaysia and China is always the top 2 of Singapore’s trading partners and in the year of 2015 China’s total number of import and export increased from 2014, when most of the countries’ number are decreasing from 2014 to 2015.\r\nIt can be observed from the figure below that Malaysia and Indonesia total merchandise trade number decreased significantly from 2014 to 2015. Some of the other countries trade number’s also decreasing, even though it is not very significant.\r\nFigure 70Indonesia and United States are two countries that have a significant changes between the year of 2011 and the year of 2019.\r\nThe trend of Indonesia’s total export and Import was going down over the years (2011 - 2019), on the other hand United States’ trend was going up over the year. The year of 2020 was not taken into consideration since Covid-19 pandemic is getting worse in that year and it affected the merchandise trade between countries.\r\nIndonesia\r\n\r\nUnited States\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T22:47:48+08:00",
    "input_file": "dataviz-makeover-2.knit.md"
  },
  {
    "path": "posts/2021-05-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1 - Merchandise trade",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "Jovinka Hartanto",
        "url": "https://www.linkedin.com/in/jovinkahartanto/"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n1. Introduction\r\nNowadays, data visualisation such as graphs and maps can be found anywhere. Data visualisation can help us to understand better what the information means and it will also make it easier to understand the trends, patterns, and outliers within large datasets. However, a poor data visualisation can be misleading or make it even harder to understand the information.\r\nThis post will makeover the merchandise trade chart below, so that it can be more fruitful for the audience. The data visualisation will be created by using data provided by Department of Statistics, Singapore (DOS). The data are available under the sub-section of Merchandise Trade by Region/Market.\r\nFigure 12. Critique of Visualisation\r\nTo explore different perspective and design more truthful and enlightening data visualisation, we will first observe the original visualisation. The critiques will be divided into two section, clarity and aesthetics.\r\n2.1 Clarity\r\nThe title of the graph does not match the visualisation. The title leads us to expect that the graph will be showing merchandise trade data for period 2019 to 2020, meanwhile the x-axis label for Japan only shows year of 2020 and the period for the rest of the graph starts from 2019 and ends in 2021.\r\nThe period of the data used is inconsistent. According to the graph, it seems like it covers merchandise trade data from 2019 to 2021 for Hong Kong, Mainland China, Taiwan, US, and Malaysia. However, we can observe that for Japan, it only covers merchandise trade data in 2020.\r\nThe title of X axis is confusing. The axis title clearly mentions “Month of Period”, but the x-axis label display years instead of months.\r\nThere is no lead-in or call-outs to provide context.\r\n2.2 Aesthetics\r\nIt is difficult to see some data points in the chart.The graph will be easier to understand if line graph were used. Area graph make some data points harder to read, since some of the data points are overlapped between import and export.\r\nThere is no tick marks for both axis even though this graph is a continuous scale. The non existence of the graph make it harder to read the data points.\r\nThe choices of colors can be improved. More contrast colors might able to make the graph easier to read.\r\nThe title does not align with the graphs. The placing of the title is not in the center nor left-aligned.\r\n3. Alternative Design\r\nThe alternative graphical design proposed can be seen below:\r\nfigure 2The proposed design above will improve the original visualisation in terms of:\r\nClarity:\r\nLine graph is used for the visualisation and the label of x-axis is changed to month and year instead of only year. These two combination will make it easier to see the merchandise trade’s trend for each country.\r\nExport and Import is split into two different graph, which make it easier to compare import and export trend among the top six Singapore’s merchandise trade partners.\r\nAdditional charts is added to paint a clearer picture of how the export and import values changed from 2019 to 2020 for each country. The scatter plot will also show the relationship between of export value and import value for each top trading partners.\r\nThe title match the content of the graph.\r\nThe period of the data used will be consistent for all countries.\r\nAesthetics:\r\nMajor tick marks is added for both axis since it is continuous scale.Tick marks will make the graph easier to read.\r\nThe color of the charts were chosen to guarantee that most people who are colorblind can distinguish groups of data that are color coded\r\nThe title is now aligned with the position of the graph, the chart titles are all left aligned.\r\n4. Step-by-Step Guide\r\n4.1 Data Preparation\r\nClean the raw data by selecting all countries’ merchandise trade data for the year 2019 to 2020. Copy the table from the raw dataset and paste it into the first row of the new created worksheet by using excel workbook. Clean import and export data are stored in two different worksheets.\r\nimport data:\r\nFigure 3Export data:\r\nFigure 4Create a new column in the clean data worksheets to store the country name.\r\nFigure 5Import the data into tableau and join import and export data by country, the steps are as follows:\r\nOpen tableau and select microsoft excel under connect panel -> select the file type\r\nFigure 6Drag the sheets that need to be imported to the workspace one by one\r\nFigure 7Edit the relationship by typing country in both of the search bars\r\nFigure 8Click Country1 and Country(T1-Clean(Export)) -> close\r\nFigure 9Hide the unwanted column(s) that is not needed for the data preparation or analysis by clicking the small arrow beside the column name -> hide\r\nFigure 10New worksheet is needed for the next step of data preparation.\r\nFigure 11Create a text table by placing country on the rows shelves and monthly import data in columns and then click text table from show me.\r\nFigure 12The text table are shown in the figure below.\r\nFigure 13Pivot the data from crosstab format to columnar format by viewing the data in tableau.\r\nFigure 14Click Export All and save it as excel file.\r\nFigure 15Split the measure names into two columns (year and month) by using excel for both import and export data.\r\nFigure 16To create a date value in excel, convert the month names into number. Create a new column called “Date” in excel according to the year and month in measure name.\r\nFigure 17Repeat step 4 to 7 for merchandise export data. Merge columnar format import and export data into one excel file to make it easier when importing the data into tableau.\r\nFigure 18Import clean merchandise data into tableau and join both dataset by country and date (the step by step guide of importing the data can be seen in step 3). Select the merchandise trade data for top six trading countries that were mentioned in the original graph by using filter function in data source tab.\r\nFigure 19After clicking add in filters,click Add again in “edit data source filter” window.\r\nFigure 20Select country -> OK. Select all the countries that we need for the analysis, by clicking the checkboxes in front of the country.\r\nFigure 21After the filter was applied, the top six merchandise trade data is ready to be used for the analysis.\r\n4.2 Monthly Merchandise Trade Performance, 2019 -2020\r\nThis visualisation will be using monthly import and export data for each country.\r\nDrag export and import data to Rows shelf and drag country into colour.\r\nFigure 22click the small arrow in Year inside the column shelf, select month that is highlighted in blue.\r\nFigure 23Right Click on X-axis to edit the date range.\r\nFigure 24Change the date range, title, and tick marks settings as per below.\r\nFigure 25Figure 26Right Click on the X-axis -> Format, to edit the label’s and tick marks’ font and color. Since the background color is white, change the tick mark’s color to black, so they will be visible. Custom the label format to mmm yy, and choose up for the alignment.\r\nFigure 274.3 Net Importers and Net Exporters, 2019 - 2020\r\nThis graph is to show the relationship between import and export data.\r\nDrag Date and Export to column shelf and drag Import to row shelf\r\nDrag Country to Text and Detail, drag Date to Color\r\nFigure 28Hide the legend of the graph, by clicking the small arrow in the legend -> Hide Card\r\nFigure 29The steps to create the 45 degree line, are as follow:\r\nDrag Import to columns shelf -> Click the small arrow -> Dual Axis\r\nFigure 30Click Sum(Import) in the columns shelf and edit the components under marks shelf\r\nRemove Country (Text - SUM(Import)) from Marks shelf\r\nFigure 31Click Color in SUM(Import) -> change the opacity to 0%\r\nFigure 32Right click on the graph -> Trend Lines -> Show Trend Lines -> SUM(Import)\r\nFigure 33Change the axis range to Fixed -> change Fixed start and Fixed end\r\nFigure 34Make sure all these 5 axis have same range\r\nFigure 35Change the format of the 45 degree line by double clicking the line -> Format\r\nChange the format of the trend line to dotted line\r\nFigure 36Hide the header for the top axis. Right click on the axis -> Show Header\r\nFigure 37Hide field labels for columns\r\nFigure 38Change the color of the graph by choosing color for SUM(Export) in Marks shelf -> select the data item -> choose the color\r\nFigure 39Change the title of the graph by double clicking the title -> Change the title -> Apply -> OK\r\nFigure 40Add the annotation by right clicking the graph -> Annotate -> Area\r\nFigure 414.4 Yearly Merchandise Trade Comparison by Country, 2019-2020\r\nThe third graph is to find the percentage change of total merchandise trade for each country for the year 2019 to 2020.\r\nDrag Country and Date to columns shelf -> Drag Export to rows shelf twice\r\nFigure 42Click the small arrow in one of the SUM(Export) -> Dual Axis\r\nFigure 43Change one of the Sum(Export) line graph to circle under Marks shelf. Do this for import graph too. Adjust the circle by clicking size.\r\nFigure 44To make the graph clearer, set a different color for different year for both import and export circle graph by dragging Date to color.\r\nFigure 45Percent difference was calculated for each country to see how the merchandise trade changes from 2019 to 2020. The steps to add percent difference are as follow:\r\nDrag Export to line graph SUM(Export) - Label\r\nFigure 46Click the small white arrow in line graph SUM(Export) inside the Marks Shelf -> Quick Table Calculation -> Percent Difference\r\nFigure 47Click the small white arrow again -> Calculate Using -> Date\r\nFigure 48Repeat step 1 to 5 to show the percent difference for import graph\r\n4.5 Dashboard\r\nConsolidate all the three worksheets into one dashboard.\r\nTo create a new dashboard, click the New Dashboard Tab\r\nFigure 49We can adjust the dashboard size, change Fixed size to Automatic is highly recommended\r\nFigure 50Drag the worksheets to the canvas, tick Show dashboard title if needed\r\nFigure 51Change the dashboard title by double clicking the title, same as changing the worksheet’s title\r\nThe final dashboard is ready\r\n5.0 Major Obeservations\r\nAmong the top six Singapore’s trading partners, the number of countries that has value of goods exported by Singapore exceeds the goods imported by them in 2020 is higher compare to 2019. In 2019, the value of exports exceed imports for Singapore’s merchandise trade with Mainland China and Hong Kong. In comparison, in 2020 the value of exports also exceeds imports for the merchandise trade with US. The biggest export destination of Singapore’s goods is Mainland China, followed by Hong Kong for both years, 2019 and 2020. However, Hong Kong has extremely high export value compare to its import value, which made Hong Kong the biggest contributor to Singapore’s net exports value.\r\nFigure 52The export value for United States increased by almost 20% in 2020, it started to increase at the end of 2019 and the peak is in April and July 2020. On the other hand, export value from Singapore to Malaysia decreased by 18.24% in 2020, it can be observed that the value started to decrease in early 2020, this might be due to a lack for demand in petroleum products because of the Covid-19 pandemic. In 2019, the main product that Singapore exported to Malaysia is refined petroleum and the petroleum products export from Singapore in Apr-Jul 2020 is around 55% lower than Apr-Jul 2019.\r\nMalaysia (MYS) and Singapore (SGP) Trade\r\nBruce-Lockhart, 2020\r\nFigure 53Figure 54Import from Taiwan to Singapore increased by 13.36%, this is expected since Taiwan record historical high exports in 2020. This surged might be because of Taiwan’s success in controlling the pandemic, it helped Taiwan get many orders diverted from other source and its semiconductor sector continued to dominate the global market with advanced manufacturing processes.\r\nFigure 55Focus Taiwan - CNA English News, 2021\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T20:38:24+08:00",
    "input_file": {}
  }
]
